/*	Εικ. 3.6
	Πρόγραμμα μέσου όρου βαθμολογίας, με επανάληψη που ελέγχετα από μετρητή
	*/

#include <stdio.h>

int main(void) {
	unsigned int counter; // Ο βαθμός που θα εισαχθεί μετά
	int grade, total, average; // Βαθμός, Σύνολο, Μέσος Όρος

	// Αρχικοποίηση
	total = 0;	// Αρχικοποίηση του total (αριθμός των μαθητών)
	counter	= 1; // Αρχικοποίηση του μετρητή βαθμού

	// Φάση επεξεργασίας
	while (counter <= 10) { 	// Επανέλαβε 10 φορές
		printf("Εισαγωγή βαθμού: ");
		scanf("%d", &grade);
		
		total = total + grade;	// Πρόσθεσε βαθμό στο σύνολο
		counter = counter + 1;	// Αύξησε μετρητή
	}

	// Τερματισμός
	average = total / 10;	// Ακέραια διαίρεση

	printf("Ο μέσος όρος της τάξης, είναι: %d\n", average);
	printf("Το σύνολο των βαθμών της τάξης, είναι: %d\n", total); 	// Το έγραψα προεραιτικά για να το ελέγξω


	
}